cfd/baseCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);//$flowVelocity;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    inlet
    {
        type	fixedValue;
	value	uniform (10 0 0);
	    //type            atmBoundaryLayerInletVelocity;
        //#include        "include/ABLConditions"
    }

    terrain
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    ground
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
