cfd/baseCase/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

disk1
{
    type            actuationDiskSource;

    selectionMode   cellZone;//cellSet;
    cellZone         actuationDisk1;

    diskDir         (1 0 0);    // Orientation of the disk
    Cp              0.45;
    Ct              0.8;
    diskArea        7854;
    upstreamPoint   (-60 0 100);
}

//disk2
//{
//    type            actuationDiskSource;

//    selectionMode   cellSet;
//    cellSet         actuationDisk2;

//    diskDir         (1 0 0);    // Orientation of the disk
//    Cp              0.53;
//    Ct              0.58;
//    diskArea        40;
//    upstreamPoint   (581753 4785663 1070);
//}


// ************************************************************************* //
